---
kind: other
id: Properties.T:Autodesk.Revit.DB.STEPImportOptions
source: html/0d8fd2fa-3607-9e1f-8799-36ade8bf1be8.htm
---
# STEPImportOptions Properties

Correct almost-vertical lines and almost-horizontal lines for import model
 if option is set to true, the almost-vertical lines would be vertical lines and almost-horizontal lines would be horizontal lines.